
## Plan Result (terraform/settings)

[CI link](https://github.com/air-hand/dotfiles/actions/runs/9839095053)


<pre><code>Plan: 3 to import, 1 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * github_issue_label.dependencies[&#34;major&#34;]
* Update
  * github_issue_label.dependencies[&#34;dependencies&#34;]
  * github_issue_label.dependencies[&#34;minor&#34;]
  * github_issue_label.dependencies[&#34;patch&#34;]
* Import
  * github_issue_label.dependencies[&#34;dependencies&#34;]
  * github_issue_label.dependencies[&#34;minor&#34;]
  * github_issue_label.dependencies[&#34;patch&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # github_issue_label.dependencies["dependencies"] will be updated in-place
  # (imported from "dotfiles:dependencies")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "0366d6" -> "0366D6"
        description = "Pull requests that update a dependency file"
        etag        = "W/\"ba3b22bbed92bd0826b3bb0ad808dd4640f4eb913dd5ca02ed6be4a1f11c925e\""
        id          = "dotfiles:dependencies"
        name        = "dependencies"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/dependencies"
    }

  # github_issue_label.dependencies["major"] will be created
  + resource "github_issue_label" "dependencies" {
      + color      = "FF0000"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "major"
      + repository = "dotfiles"
      + url        = (known after apply)
    }

  # github_issue_label.dependencies["minor"] will be updated in-place
  # (imported from "dotfiles:minor")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "ededed" -> "00FF00"
        description = null
        etag        = "W/\"1426ad7c309fff692a2203d533329cfb3258f49b3c3dc85cee858b21159b63af\""
        id          = "dotfiles:minor"
        name        = "minor"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/minor"
    }

  # github_issue_label.dependencies["patch"] will be updated in-place
  # (imported from "dotfiles:patch")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "ededed" -> "0000FF"
        description = null
        etag        = "W/\"25696ca7e5a003da526302b51cf9883745b89450289a6be2138a1eaad70ca6cd\""
        id          = "dotfiles:patch"
        name        = "patch"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/patch"
    }

Plan: 3 to import, 1 to add, 3 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":159,"Program":"tfcmt","SHA1":"478e0fab44270e3069c9d6f76a0f4d2a965c754c","Target":"terraform/settings","Vars":{},"WorkflowName":"Terraform plan and apply"} -->